In [1]:
import pandas as pd

In [2]:
data = [1,2,3,4]

In [3]:
series= pd.Series(data)
print(series)
type(series)

0    1
1    2
2    3
3    4
dtype: int64

pandas.core.series.Series

In [4]:
data= [[1,2,3,4,65],[2,3,41111,3333],'abc']
df=pd.DataFrame(data)
df

   0  1      2       3     4
0  1  2      3     4.0  65.0
1  2  3  41111  3333.0   NaN
2  a  b      c     NaN   NaN

In [5]:
dictdata={"a":[1,2,4,5566,333],"c":[2323,4545,233323,1,"xx"]}
df2= pd.DataFrame(dictdata)
df2

      a       c
0     1    2323
1     2    4545
2     4  233323
3  5566       1
4   333      xx

In [6]:
d1=pd.DataFrame({"A":[1,2,3],"B":[2,3,4]})
d1

   A  B
0  1  2
1  2  3
2  3  4

In [7]:
d2=pd.DataFrame({"A":[3,4,5],"C":[11,12,23]})
d2

   A   C
0  3  11
1  4  12
2  5  23

In [8]:
pd.concat([d1,d2])

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0   NaN
0  3  NaN  11.0
1  4  NaN  12.0
2  5  NaN  23.0

In [9]:
pd.concat([d1,d2],axis=0,join="inner")

   A
0  1
1  2
2  3
0  3
1  4
2  5

In [10]:
pd.concat([d1,d2],axis=1,join="inner")

   A  B  A   C
0  1  2  3  11
1  2  3  4  12
2  3  4  5  23

In [11]:
pd.merge(d1,d2,on=["A"],how="inner")

   A  B   C
0  3  4  11

In [12]:
pd.merge(d1,d2,on=["A"],how="outer")

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0  11.0
3  4  NaN  12.0
4  5  NaN  23.0

In [13]:
pd.merge(d1,d2,how="right")

   A    B   C
0  3  4.0  11
1  4  NaN  12
2  5  NaN  23

In [14]:
pd.merge(d1,d2,how="left")

   A  B     C
0  1  2   NaN
1  2  3   NaN
2  3  4  11.0

In [15]:
pd.merge(d1,d2,how="outer")

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0  11.0
3  4  NaN  12.0
4  5  NaN  23.0

In [16]:
import numpy as np

In [17]:
saldet= np.array([[50000,60000],['James','Joseph']])
salDataF= pd.DataFrame({'name':saldet[1],'salary':saldet[0]})
salDataF

     name salary
0   James  50000
1  Joseph  60000

In [18]:
#Merge Operation

In [19]:
players=['Joseph','James','Joanne']
points=[89,96,100]
titles=['Game1','Game2','Game5']
gameframe=pd.DataFrame({'Game':titles,'Players':players,'Points':points})
gameframe

    Game Players  Points
0  Game1  Joseph      89
1  Game2   James      96
2  Game5  Joanne     100

In [20]:
players=['Joseph','Dean','Dame']
powers=['Punch', 'Kick','Throw']
titles=['Game1','Game3','Game4']
anothframe=pd.DataFrame({'Game':titles,'Players':players,'Powers':powers})
anothframe

    Game Players Powers
0  Game1  Joseph  Punch
1  Game3    Dean   Kick
2  Game4    Dame  Throw

In [23]:
#innner merge
gameframe.merge(anothframe,on='Game',how='inner')

    Game Players_x  Points Players_y Powers
0  Game1    Joseph      89    Joseph  Punch

In [22]:
#innner merge
gameframe.merge(anothframe,on='Players',how='inner')

  Game_x Players  Points Game_y Powers
0  Game1  Joseph      89  Game1  Punch

In [24]:
#left merge
gameframe.merge(anothframe,on='Game',how='left')

    Game Players_x  Points Players_y Powers
0  Game1    Joseph      89    Joseph  Punch
1  Game2     James      96       NaN    NaN
2  Game5    Joanne     100       NaN    NaN

In [25]:
#left merge
gameframe.merge(anothframe,on='Players',how='left')

  Game_x Players  Points Game_y Powers
0  Game1  Joseph      89  Game1  Punch
1  Game2   James      96    NaN    NaN
2  Game5  Joanne     100    NaN    NaN

In [26]:
#right merge
gameframe.merge(anothframe,on='Game',how='right')

    Game Players_x  Points Players_y Powers
0  Game1    Joseph    89.0    Joseph  Punch
1  Game3       NaN     NaN      Dean   Kick
2  Game4       NaN     NaN      Dame  Throw

In [27]:
#right merge
gameframe.merge(anothframe,on='Players',how='right')

  Game_x Players  Points Game_y Powers
0  Game1  Joseph    89.0  Game1  Punch
1    NaN    Dean     NaN  Game3   Kick
2    NaN    Dame     NaN  Game4  Throw

In [28]:
#outer merge
gameframe.merge(anothframe,on='Game',how='outer')

    Game Players_x  Points Players_y Powers
0  Game1    Joseph    89.0    Joseph  Punch
1  Game2     James    96.0       NaN    NaN
2  Game5    Joanne   100.0       NaN    NaN
3  Game3       NaN     NaN      Dean   Kick
4  Game4       NaN     NaN      Dame  Throw

In [29]:
#outer merge
gameframe.merge(anothframe,on='Players',how='outer')

  Game_x Players  Points Game_y Powers
0  Game1  Joseph    89.0  Game1  Punch
1  Game2   James    96.0    NaN    NaN
2  Game5  Joanne   100.0    NaN    NaN
3    NaN    Dean     NaN  Game3   Kick
4    NaN    Dame     NaN  Game4  Throw

In [30]:
players=['Joseph','James','Joanne']
points=[89,96,100]
titles=['Game1','Game2','Game5']
gf1=pd.DataFrame({'Game':titles,'Players':players,'Points':points},index=['L1','L2','L3'])
gf1

     Game Players  Points
L1  Game1  Joseph      89
L2  Game2   James      96
L3  Game5  Joanne     100

In [31]:
players=['Joseph','Dean','Dame']
powers=['Punch', 'Kick','Throw']
titles=['Game1','Game3','Game4']
gf2=pd.DataFrame({'Game':titles,'Players':players,'Powers':powers},index=['L2','L3','L4'])
gf2

     Game Players Powers
L2  Game1  Joseph  Punch
L3  Game3    Dean   Kick
L4  Game4    Dame  Throw

In [34]:
gf1.join(gf2,how='inner', lsuffix='_left', rsuffix='_right')

   Game_left Players_left  Points Game_right Players_right Powers
L2     Game2        James      96      Game1        Joseph  Punch
L3     Game5       Joanne     100      Game3          Dean   Kick